InformationRegisters/ПользователиСокращенногоСпискаПечатныхФормЗаказНаряда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПользователиСокращенногоСпискаПечатныхФормЗаказНаряда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПользователиСУчетомПодразделенияРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПользователиСУчетомПодразделенияРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДляНовыхДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеГКДляНовыхДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Цеха.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Цеха</Name>
			<Comment>Цеха компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании, к которому относится цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Comment>Мастер цеха, подставляемый по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехДляАнализаЭффиктивности</Name>
					<Comment>Цех для анализа эффиктивности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВУРВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПоста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПерепродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЦехПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТехнологическиеАвтоработы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СМ_Глобальный/Ext/Module.bsl
Процедура СМГ_Сообщить(ТекстСообщения,Статус=Неопределено) Экспорт
	#Если Клиент Тогда
		Сообщить(ТекстСообщения,Статус);
 	#КонецЕсли 
КонецПроцедуры //СМГ_Сообщить(ТекстСообщения,Статус=Неопределено)

Процедура СМГ_Предупреждение(ТекстПредупреждения,Таймаут=0,Заголовок="") Экспорт
	#Если Клиент Тогда
		Предупреждение(ТекстПредупреждения,Таймаут,Заголовок);
 	#КонецЕсли 
КонецПроцедуры //Предупреждение(ТекстПредупреждения,Таймаут=Неопределено,Заголовок=Неопределено)
 
Функция ПолучитьСуммуЗакупкиБУглобальный(Автомобиль) Экспорт
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		ЗапросАвтомобиль = Новый Запрос();
		ЗапросАвтомобиль.УстановитьПараметр("Автомобиль", Автомобиль);
		ЗапросАвтомобиль.УстановитьПараметр("ЧастноеЛицо", Перечисления.ФормыСобственности.ЧастноеЛицо);
		ЗапросАвтомобиль.Текст = "ВЫБРАТЬ
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК ДатаПоступления,
		|	ПоступлениеАвтомобилейАвтомобили.СуммаВсего
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		|ГДЕ
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
		|	И ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ
		|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности = &ЧастноеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПоступления УБЫВ";
		
		Результат = ЗапросАвтомобиль.Выполнить().Выгрузить();
		Если Результат.Количество() > 0 Тогда
			СуммаЗакупкиБУ =  Результат[0].СуммаВсего;
		Иначе
			СуммаЗакупкиБУ = 0;
		КонецЕсли;
	Иначе
		СуммаЗакупкиБУ = 0;
	КонецЕсли;
	
	Возврат СуммаЗакупкиБУ;
	
КонецФункции // ПолучитьСуммуЗакупкиБУ(Автомобиль)

//Бондаренко++ 20240508
Функция ПолучитьСуммуЗакупкиБУучетДатыГлобальный(Автомобиль,Дата) Экспорт
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
 		
		ЗапросАвтомобиль = Новый Запрос();
		
		СЗ_Форм = Новый СписокЗначений; 
 		
		СЗ_Форм.Добавить(Перечисления.ФормыСобственности.ЧастноеЛицо);
		СЗ_Форм.Добавить(Перечисления.ФормыСобственности.Прочее);
		
		Если Дата >= Дата(2024,4,1) Тогда
 			СЗ_Форм.Добавить(Перечисления.ФормыСобственности.ЮридическоеЛицо);
			СЗ_Форм.Добавить(Перечисления.ФормыСобственности.ЧастныйПредприниматель);
		КонецЕсли;
		
		ЗапросАвтомобиль.УстановитьПараметр("СЗ_Форм", СЗ_Форм);
		ЗапросАвтомобиль.УстановитьПараметр("Автомобиль", Автомобиль);
		ЗапросАвтомобиль.УстановитьПараметр("Дата", Дата);
 		
		ЗапросАвтомобиль.Текст = "ВЫБРАТЬ
		                         |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК ДатаПоступления,
		                         |	ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего
		                         |ИЗ
		                         |	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		                         |ГДЕ
		                         |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
		                         |	И ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ
		                         |	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		                         |	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности В(&СЗ_Форм)
		                         |	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата < &Дата
		                         |
		                         |УПОРЯДОЧИТЬ ПО
		                         |	ДатаПоступления УБЫВ";
		
		Результат = ЗапросАвтомобиль.Выполнить().Выгрузить();
		Если Результат.Количество() > 0 Тогда
			СуммаЗакупкиБУ =  Результат[0].СуммаВсего;
		Иначе
			СуммаЗакупкиБУ = 0;
		КонецЕсли;
	Иначе
		СуммаЗакупкиБУ = 0;
	КонецЕсли;
	
	Возврат СуммаЗакупкиБУ;
	
КонецФункции // ПолучитьСуммуЗакупкиБУучетДатыГлобальный(Автомобиль,Дата)
//Бондаренко++ 20240508

//Бондаренко-- 20240731
Функция ПолучитьСуммуЗакупкиБУучетДатыИНашихФирмГлобальный(Автомобиль,Дата) Экспорт
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
 		
		ЗапросАвтомобиль = Новый Запрос();
		
		СЗ_Форм = Новый СписокЗначений; 
 		
		СЗ_Форм.Добавить(Перечисления.ФормыСобственности.ЧастноеЛицо);
		СЗ_Форм.Добавить(Перечисления.ФормыСобственности.Прочее);
		
		Если Дата >= Дата(2024,4,1) И Дата <= Дата(2024,7,31) Тогда
 			СЗ_Форм.Добавить(Перечисления.ФормыСобственности.ЮридическоеЛицо);
			СЗ_Форм.Добавить(Перечисления.ФормыСобственности.ЧастныйПредприниматель);
		КонецЕсли;
		
		ЗапросАвтомобиль.УстановитьПараметр("СЗ_Форм", СЗ_Форм);
		ЗапросАвтомобиль.УстановитьПараметр("Автомобиль", Автомобиль);
		ЗапросАвтомобиль.УстановитьПараметр("Дата", Дата);
 		
		ЗапросАвтомобиль.Текст = "ВЫБРАТЬ
		                         |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата КАК ДатаПоступления,
		                         |	ПоступлениеАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего
		                         |ИЗ
		                         |	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		                         |ГДЕ
		                         |	ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
		                         |	И ПоступлениеАвтомобилейАвтомобили.АвтомобильБУ
		                         |	И ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		                         |	И (ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.ФормаСобственности В (&СЗ_Форм)
		                         |			ИЛИ ПоступлениеАвтомобилейАвтомобили.Ссылка.Контрагент.НашаФирма)
		                         |	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Дата < &Дата
		                         |
		                         |УПОРЯДОЧИТЬ ПО
		                         |	ДатаПоступления УБЫВ";
		
		Результат = ЗапросАвтомобиль.Выполнить().Выгрузить();
		Если Результат.Количество() > 0 Тогда
			СуммаЗакупкиБУ =  Результат[0].СуммаВсего;
		Иначе
			СуммаЗакупкиБУ = 0;
		КонецЕсли;
	Иначе
		СуммаЗакупкиБУ = 0;
	КонецЕсли;
	
	Возврат СуммаЗакупкиБУ;
	
КонецФункции // ПолучитьСуммуЗакупкиБУучетДатыИНашихФирмГлобальный(Автомобиль,Дата)
//Бондаренко++ 20240731

//Бондаренко++ 20240803
Функция СокращенныйСписокПечатныхФормЗаказНаряда() Экспорт
	
	Рез = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиСокращенногоСпискаПечатныхФормЗаказНаряда.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ПользователиСокращенногоСпискаПечатныхФормЗаказНаряда КАК ПользователиСокращенногоСпискаПечатныхФормЗаказНаряда
		|ГДЕ
		|	ПользователиСокращенногоСпискаПечатныхФормЗаказНаряда.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез = Истина;
	КонецЦикла;
	
 	Возврат Рез;
	
КонецФункции // СокращенныйСписокПечатныхФормЗаказНаряда()
//Бондаренко-- 20240803

//Бондаренко++ 20240803
Функция УчитыватьПодразделениеПользователя() Экспорт
	
	Рез = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиСУчетомПодразделенияРаботы.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ПользователиСУчетомПодразделенияРаботы КАК ПользователиСУчетомПодразделенияРаботы
		|ГДЕ
		|	ПользователиСУчетомПодразделенияРаботы.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез = Истина;
	КонецЦикла;
	
 	Возврат Рез;
	
КонецФункции // УчитыватьПодразделениеПользователя()
//Бондаренко-- 20240803

//Иванченко 20241205 ++
Функция УчитыватьПользователяПоМаркеАвто() Экспорт
	
	Рез = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиПоМаркам.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ПользователиПоМаркам КАК ПользователиПоМаркам
		|ГДЕ
		|	ПользователиПоМаркам.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез = Истина;
	КонецЦикла;
	
 	Возврат Рез;
	
КонецФункции
//Иванченко 20241205 --

//Бондаренко++ 20241010
Функция НайтиОсновнойЦехПодразделения(ПодразделениеКомпании) Экспорт
	
	Цех_ = "";
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Цеха.Ссылка КАК Ссылка,
		|	Цеха.Подразделение КАК Подразделение,
		|	Цеха.ОсновнойЦехПодразделения КАК ОсновнойЦехПодразделения,
		|	Цеха.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.Цеха КАК Цеха
		|ГДЕ
		|	НЕ Цеха.ПометкаУдаления
		|	И Цеха.Подразделение = &Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОсновнойЦехПодразделения УБЫВ";
	
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цех_ = ВыборкаДетальныеЗаписи.Ссылка;
		Прервать;
	КонецЦикла;
  	
	Возврат Цех_;
	
КонецФункции // НайтиОсновнойЦехПодразделения(ПодразделениеКомпании)
//Бондаренко-- 20241010

//Бондаренко++ 20240810
Функция НайтиПодразделениеПользователяДляНовыхДокументов() Экспорт
	
	Подразделение_ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиСУчетомПодразделенияРаботы.Пользователь КАК Пользователь,
		|	ПользователиСУчетомПодразделенияРаботы.ПодразделениеДляНовыхДокументов КАК ПодразделениеДляНовыхДокументов
		|ИЗ
		|	РегистрСведений.ПользователиСУчетомПодразделенияРаботы КАК ПользователиСУчетомПодразделенияРаботы
		|ГДЕ
		|	ПользователиСУчетомПодразделенияРаботы.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Подразделение_ = ВыборкаДетальныеЗаписи.ПодразделениеДляНовыхДокументов;
	КонецЦикла;
	
 	Возврат Подразделение_;
	
КонецФункции // НайтиПодразделениеПользователяДляНовыхДокументов()
//Бондаренко-- 20240810
